<html>
<head>
	<title>Ajuda de Terminologia inform&agrave;tica</title>
	<style type="text/css">
		a.western:link { so-language: zxx }
		a.cjk:link { font-size: 10pt }
	</style>
</head>
<body>
<h1>Terminologia inform&agrave;tica</h1>
Versi&oacute; 1.0
<p>L'aplicaci&oacute; Terminologia Inform&agrave;tica permet consultar, de
manera f&agrave;cil les equival&egrave;ncies en catal&agrave; dels termes inform&agrave;tics
anglesos.</p>
	<p>
		La base de dades terminol&ograve;gica est&agrave;
		constru&iuml;da sobre el
		<a class="western"
			href="http://www.softcatala.org/recull.html">
			Recull de termes de Softcatal&agrave;
		</a>.
	</p>
<h2>Pantalla principal</h2>
<img alt="Finestra principal" src="images/TermInfCatMain.png">
<p>La pantalla principal de l'aplicaci&oacute; consta dels seg&uuml;ents elements:</p>
<ul>
<li>Un <b>camp d'entrada</b> on podem escriure el terme (o una part del terme) a buscar</li>
<li>Una <b>taula de resultats</b> que mostrar&agrave; els resultats d'una cerca en tres columnes:
<ul>
<li>El mot o l'expressi&oacute; en angl&egrave;s que cont&eacute; el que h&agrave;gim escrit al camp de cerca</li>
<li>La traducci&oacute; al catal&agrave;</li>
<li>La categoria gramatical</li>
</ul>
</li>
<li>Tres <b>botons</b> d'accions:
<ul>
<li><b>Cercar</b>: Fa una cerca a la base de dades el contingut del camp d'entrada</li>
<li><b>Netejar</b>: Neteja de contingut el camp d'entrada i la taula de resultats i situa el cursor al camp d'entrada</li>
<li><b>Sortir</b>: Tanca l'aplicaci&oacute;
</ul>
</li>
</ul>

<h2>Cerca</h2>
<img alt="Cerca d'un terme" src="images/TermInfCatSearchResult.png">
<p>
L'aplicaci&oacute; en fer clic al bot&oacute; <code>Cercar</code> o polsar la tecla de retorn quan estem situats al camp d'entrada, fa una cerca a la base de dades.
</p>
<p>
La cerca consisteix a trobar termes o expressions angleses que continguin la tira de car&agrave;cters del camp d'entrada.<br/>
A la imatge, podem veure com cerquem el terme angl&egrave;s <i>book</i> i obtenim fins a 8 resultats. Observi's que no estem buscant una coincid&egrave;ncia exacta de <i>book</i> sin&oacute; 
els termes i expressions angleses que contenen <i>book</i>. &Eacute;s el cas d'&quot;<i>address <b>book</b></i>&quot; i de &quot;<i><b>book</b>mark</i>&quot;.
</p>
<h3>C&ograve;pia dels resultats</h3>
<p>
Si fem clic a sobre d'una renglera dels resultats, la traducci&oacute; catalana es copiar&agrave; autom&agrave;ticament al porta-retalls i 
la podrem enganxar on ens convingui.
</p>
<p>
Tamb&eacute; podem seleccionar el conjunt dels resultats fent clic a la taula de resultats, polsant <code>Ctrl-A</code> per seleccionar-los 
tots i <code>Ctrl-C</code> per copiar-los al porta-retalls. Tot seguit, els podem enganxar, per exemple, a un full de c&agrave;lcul. 
</p>
<h3>Ordenaci&oacute; dels resultats</h3>
<p>
Els resultats s'ordenen alfab&egrave;ticament pel terme angl&egrave;s. 
</p>
<p>
Podem canviar l'ordenaci&oacute; fent clic a la cap&ccedil;alera de la columna de la taula de resultats per on vulguem ordenar.
</p>
<p>
Un clic ens ordenar&agrave; els resultats en ordre ascendent, un segon clic ens els ordenar&agrave; en ordre descendent i 
un tercer clic ens els deixar&agrave; en l'ordre original.
</p>
<h2>Combinacions de tecles</h2>
<table border="1">
<thead>
<tr>
<th>Funci&oacute;</th>
<th>Tecles</th>
</tr>
</thead>
<tbody>
<tr>
<td><b>Ajuda</b></td>
<td>F1</td>
</tr>
<tr>
<td><b>Cercar</b></td>
<td>Tecla de retorn, al camp d'entrada</td>
</tr>
<tr>
<td><b>Netejar</b></td>
<td>Esc</td>
</tr>
<tr>
<td><b>Sortir</b></td>
<td>F3</td>
</tr>
</tbody>
</table>
<p><font face="Liberation Serif, serif"><strong>&copy; 2015 Francesc Ros&eacute;s
Albiol (Aplicaci&oacute;)</strong></font><br/>
<font face="Liberation Serif, serif"><strong>&copy; 2015 Softcatal&agrave; (Recull
de termes)</strong></font></p>
</body>

</html>
